var data = [];
var dataStr = '1、馄饨<br>\
<br>\
【鲜肉馄饨】：将猪肉和葱剁碎并搅拌后，以馄饨皮包裹后煮食，是最基本的作法<br>\
【虾肉馄饨】：以剁碎虾肉及猪肉制成。<br>\
【菜肉馄饨】：以猪肉搭配切丝的青江菜，通常体积较大，亦称“菜肉大馄饨”。<br>\
【炸馄饨】：以油炸的方式烹调。<br>\
8元一份<br>\
<br>\
<br>\
2、肉夹馍<br>\
<br>\
外观焦黄，条纹清晰，内部呈层状，饼体发胀，皮酥里嫩，火功到家<br>\
食用时温度以烫手为佳，且老潼关肉夹馍是热馍夹凉肉，饼酥肉香，爽而不腻）<br>\
肉夹馍是陕西著名小吃<br>\
7元一份<br>\
<br>\
<br>\
3、面皮<br>\
<br>\
当地多热食，称热面皮，亦可置于通风处降温后凉拌<br>\
配以黄瓜丝或滚水氽过的黄豆芽、土豆丝、芹菜、菠菜、胡萝卜丝等垫在碗底<br>\
和面皮同时调味，爽脆感和软糯香辣在口齿舌尖碰撞，让人更加欲罢不能...<br>\
7元一份<br>\
<br>\
<br>\
4、手抓饼<br>\
<br>\
新鲜出炉后的手抓饼，千层百叠，层如薄纸，<br>\
用手抓之，面丝千连，<br>\
其外层金黄酥脆，内层柔软白嫩，一股葱油与面筋的香味扑鼻而来<br>\
7元一份<br>\
<br>\
<br>\
5、煎饼果子<br>\
<br>\
由绿豆面薄饼，鸡蛋，还有馃子（油条）或者薄脆的“馃篦儿”组成，<br>\
配以面酱，葱末，腐乳，辣椒酱（可选）作为佐料。<br>\
还有黄豆面，黑豆面等等多种选择<br>\
5元一份<br>\
<br>\
<br>\
6、包子<br>\
<br>\
皮薄馅多，松软好吃<br>\
吃了有饱腹感<br>\
各种花样<br>\
1元一个<br>\
<br>\
<br>\
7、稀饭<br>\
<br>\
有大米、小米、黑米、莲子、花生、银耳、薏米、红豆等<br>\
有很多花样,各类都有<br>\
饱腹热量低，易消化<br>\
2元一份<br>\
<br>\
<br>\
8、酱香饼<br>\
<br>\
酱香饼以香、甜、辣、脆为主要特点，<br>\
它香中有香，甜中带绵，辣而不燥，外脆里软。<br>\
它辣而不辛，咸香松脆<br>\
3元一份<br>\
<br>\
<br>\
9、蒸饺<br>\
<br>\
用料广泛、制作方法多<br>\
酸菜猪肉蒸饺<br>\
芹菜素蒸饺<br>\
水晶蒸饺<br>\
四喜蒸饺<br>\
5元一份<br>\
';
var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0].replace('、', ' ') + '.jpg',
        caption: c[0].split('、')[1],
        desc: c[1]
    });
    console.log(c[0].replace('、', ' ') + '.jpg');
};